Mickyleitor/RollerShutterControlPanel/Firmware_ESP8266/lcd.h
            switch (currentButtonPressed) {
                case BUTTON_STATUS_LEFT:
                    if (currentAdjustedLevelIndex) {
                        currentAdjustedLevelIndex--;
                    } else {
                        newMenu = SELECCION_MENU_CONFIG_FECHA_HORA;
                    }
                    break;
                case BUTTON_STATUS_RIGHT:
                    if (currentAdjustedLevelIndex < (incsCount - 1)) {
                        currentAdjustedLevelIndex++;
                    } else {
                        adjustedTimeZone = persistentVars_get_rtcTime().timezoneShift;
                        newMenu          = SELECCION_MENU_CONFIG_ZONA_HORARIA_AJUSTE;
                    }
                    break;
                case BUTTON_STATUS_UP:
                    adjustedTime += incs[currentAdjustedLevelIndex];
                    break;
                case BUTTON_STATUS_DOWN:
                    adjustedTime -= incs[currentAdjustedLevelIndex];
                    break;
            }

            if (adjustedTime < 0) {
                adjustedTime = 0;
            }

            break;
        }
        case SELECCION_MENU_CONFIG_ZONA_HORARIA_AJUSTE: {
            switch (currentButtonPressed) {
                case BUTTON_STATUS_LEFT:
                    currentAdjustedLevelIndex = 0;
                    newMenu                   = SELECCION_MENU_CONFIG_FECHA_HORA_AJUSTE;
                    break;
                case BUTTON_STATUS_RIGHT:
                    buzzer_sound_accept();
                    rtc_set(adjustedTime, adjustedTimeZone);
                    newMenu = SELECCION_MENU_CONFIG;
                    break;
                case BUTTON_STATUS_UP:
                    adjustedTimeZone += 3600;       // Increase by 1 hour
                    if (adjustedTimeZone > 43200) { // 12 hours in seconds
                        adjustedTimeZone = 43200;
                    }
                    break;
                case BUTTON_STATUS_DOWN:
                    adjustedTimeZone -= 3600;        // Decrease by 1 hour
                    if (adjustedTimeZone < -43200) { // -12 hours in seconds
                        adjustedTimeZone = -43200;
                    }
                    break;
            }
            break;
        }
        case SELECCION_MENU_CONFIG_VOLUMEN: {
            buttonIsReleased = true;
            switch (currentButtonPressed) {
                case BUTTON_STATUS_UP:
                    newMenu = SELECCION_MENU_CONFIG_FECHA_HORA;
                    break;
                case BUTTON_STATUS_RIGHT:
                    previousBuzzerVolume  = buzzer_get_volume();
                    previousBuzzerEnabled = buzzer_is_enabled();
                    buttonIsReleased      = false;
                    newMenu               = SELECCION_MENU_CONFIG_VOLUMEN_AJUSTE;
                    break;
                case BUTTON_STATUS_DOWN:
                    newMenu = SELECCION_MENU_CONFIG_DEBUG;
                    break;
                case BUTTON_STATUS_LEFT:
                    buzzer_sound_error();
                    break;
            }
            break;
        }
        case SELECCION_MENU_CONFIG_VOLUMEN_AJUSTE:
            if (!buttonIsReleased) {
                if (currentButtonHolding != BUTTON_STATUS_NONE) {
                    break; // We are waiting for the button to be released
                }
                buttonIsReleased = true;
            }
            switch (currentButtonHolding) { // Note that we use holding here
                case BUTTON_STATUS_UP:
                    if (buzzer_get_volume() < buzzer_get_volume_max()) {
                        buzzer_set_volume(buzzer_get_volume() + 100);
                        buzzer_enable();
                    } else {
                        buzzer_set_volume(buzzer_get_volume_max());
                        buzzer_enable();
                    }
                    break;
                case BUTTON_STATUS_DOWN:
                    if (buzzer_get_volume() > buzzer_get_volume_min()) {
                        buzzer_set_volume(buzzer_get_volume() - 100);
                    } else {
                        buzzer_set_volume(buzzer_get_volume_min());
                        buzzer_disable();
                    }
                    break;
                default:
                    switch (currentButtonPressed) {
                        case BUTTON_STATUS_RIGHT:
                            buzzer_sound_accept();
                            buzzer_store_settings();
                            newMenu = SELECCION_MENU_CONFIG;
                            break;
                        case BUTTON_STATUS_LEFT:
                            buzzer_set_volume(previousBuzzerVolume);
                            if (previousBuzzerEnabled) {
                                buzzer_enable();
                            } else {
                                buzzer_disable();
                            }
                            newMenu = SELECCION_MENU_CONFIG_VOLUMEN;
                            break;
                    }
                    break;
            }
            break;
        case SELECCION_MENU_CONFIG_DEBUG:
            switch (currentButtonPressed) {
                case BUTTON_STATUS_UP:
                    newMenu = SELECCION_MENU_CONFIG_VOLUMEN;
                    break;
                case BUTTON_STATUS_RIGHT:
                    newMenu = SELECCION_MENU_CONFIG_DEBUG_SOFT_RST_COUNT;
                    break;
                case BUTTON_STATUS_DOWN:
                    newMenu = SELECCION_MENU_CONFIG_WIFI;
                    break;
                case BUTTON_STATUS_LEFT:
                    buzzer_sound_error();
                    break;
            }
            break;
        case SELECCION_MENU_CONFIG_DEBUG_SOFT_RST_COUNT:
            switch (currentButtonPressed) {
                case BUTTON_STATUS_LEFT:
                    newMenu = SELECCION_MENU_CONFIG_DEBUG;
                    break;
                case BUTTON_STATUS_UP:
                case BUTTON_STATUS_DOWN:
                case BUTTON_STATUS_RIGHT:
                    buzzer_sound_error();
                    break;
            }
            break;
        case SELECCION_MENU_CONFIG_WIFI:
            switch (currentButtonPressed) {
                case BUTTON_STATUS_UP:
                    newMenu = SELECCION_MENU_CONFIG_DEBUG;
                    break;
                case BUTTON_STATUS_RIGHT:
                    adjustedPassword = "";
                    newMenu          = SELECCION_MENU_CONFIG_WIFI_PASSWORD;
                    break;
                case BUTTON_STATUS_DOWN:
                case BUTTON_STATUS_LEFT:
                    buzzer_sound_error();
                    break;
            }
            break;
        case SELECCION_MENU_CONFIG_WIFI_PASSWORD:
            static uint8_t previousButtonHolding = BUTTON_STATUS_NONE;

