Mickyleitor/RollerShutterControlPanel/Firmware_ESP8266/lcd.h
    // If the count is greater than 9999, show "9999+".
    uint32_t softResetCount = persistentVars_get_softResetCount();
    if (softResetCount > 9999) {
        *lcdBuffer += String("9999+");
    } else {
        *lcdBuffer += String(softResetCount);
    }
    // Add spaces to fill the line.
    while (lcdBuffer->length() < 16) {
        *lcdBuffer += String(" ");
    }
    *lcdBuffer += String("<               ");
}

void pantalla_actualizarMenuConfigWifi(String* lcdBuffer) {
    *lcdBuffer += String(" CONFIG DE WIFI ");
    *lcdBuffer += String("       ");
    *lcdBuffer += LCD_SPECIAL_CHAR_UP_ARROW;
    *lcdBuffer += LCD_SPECIAL_CHAR_UP_ARROW;
    *lcdBuffer += String("      >");
}

void pantalla_actualizarMenuConfigWifiPassword(String* lcdBuffer) {
    *lcdBuffer += String("PWD: ");

    // If password is larger than 11 characters, truncate it from the
    // left to right, keeping the last 11 characters.
    String truncatedPassword = adjustedPassword;
    if (adjustedPassword.length() > 11) {
        truncatedPassword = truncatedPassword.substring(truncatedPassword.length() - 11);
    }
    *lcdBuffer += truncatedPassword;

    while (lcdBuffer->length() < 16) {
        *lcdBuffer += String(" ");
    }

    const String texts[] = {
        "<      ^^      >", // 0% holding time
        "<     -^^-     >", // 16% holding time
        "<    --^^--    >", // 33% holding time
        "<   ---^^---   >", // 50% holding time
        "<  ----^^----  >", // 66% holding time
        "< -----^^----- >", // 83% holding time
        "<------^^------>"  // 100% holding time
    };
    const unsigned long textsCount = sizeof(texts) / sizeof(texts[0]);

    unsigned long textIndex         = 0;
    const unsigned long holdingTime = millis() - buttonHoldingTimeMs;
    if (buttonHolding() == BUTTON_STATUS_DOWN) {
        textIndex = (holdingTime * textsCount) / LCD_HOLDING_TIME_CONFIRM_MS;
        if (textIndex > textsCount - 1) {
            textIndex = textsCount - 1; // Limit to the last text
        }
    } else {
        textIndex = 0;
    }

    static unsigned long lastFlashMs = 0;
    static bool flashOn              = false;

    if ((millis() - lastFlashMs) > (LCD_SLIDE_OR_FLASH_SPEED_MS / 4)) {
        lastFlashMs = millis();
        flashOn     = !flashOn;
    }

    for (unsigned long i = 0; i < 16; i++) {
        if ((i != 7) && (i != 8)) {
            *lcdBuffer += texts[textIndex][i];
        } else {
            if (textIndex != textsCount - 1) {
                if (i == 7) {
                    *lcdBuffer += LCD_SPECIAL_CHAR_UP_ARROW;
                } else {
                    *lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
                }
            } else if (flashOn) {
                *lcdBuffer += LCD_SPECIAL_CHAR_DOWN_ARROW;
            } else {
                *lcdBuffer += ' ';
            }
        }
    }
}

void pantalla_actualizarMenu(uint8_t selectedMenu) {
    String lcdBuffer = "";
    switch (selectedMenu) {
        case SELECCION_MENU_RELOJ:
            pantalla_actualizarReloj(&lcdBuffer);
            break;
        case SELECCION_MENU_PERSIANA_IZQUIERDA:
            // fall through
        case SELECCION_MENU_PERSIANA_CENTRAL:
            // fall through
        case SELECCION_MENU_PERSIANA_DERECHA: {
            uint8_t currentShutterIndex = (SELECCION_MENU_PERSIANA_TO_INDEX(selectedMenu));
            pantalla_actualizarMenuShutter(&lcdBuffer, currentShutterIndex);
            break;
        }
        case SELECCION_MENU_CONFIG:
            pantalla_actualizarMenuConfig(&lcdBuffer);
            break;
        case SELECCION_MENU_CONFIG_FECHA_HORA:
            pantalla_actualizarMenuConfigFechaHora(&lcdBuffer);
            break;
        case SELECCION_MENU_CONFIG_FECHA_HORA_AJUSTE:
            pantalla_actualizarMenuConfigFechaHoraAjuste(&lcdBuffer);
            break;
        case SELECCION_MENU_CONFIG_ZONA_HORARIA_AJUSTE:
            pantalla_actualizarMenuConfigZonaHorariaAjuste(&lcdBuffer);
            break;
        case SELECCION_MENU_CONFIG_VOLUMEN:
            pantalla_actualizarMenuConfigVolumen(&lcdBuffer);
            break;
        case SELECCION_MENU_CONFIG_VOLUMEN_AJUSTE:
            pantalla_actualizarMenuConfigVolumenAjuste(&lcdBuffer);
            break;
        case SELECCION_MENU_CONFIG_DEBUG:
            pantalla_actualizarMenuConfigDebug(&lcdBuffer);
            break;
        case SELECCION_MENU_CONFIG_DEBUG_SOFT_RST_COUNT:
            pantalla_actualizarMenuConfigDebugSoftRstCount(&lcdBuffer);
            break;
        case SELECCION_MENU_CONFIG_WIFI:
            pantalla_actualizarMenuConfigWifi(&lcdBuffer);
            break;
        case SELECCION_MENU_CONFIG_WIFI_PASSWORD:
            pantalla_actualizarMenuConfigWifiPassword(&lcdBuffer);
            break;
    }
    pantalla_sendLcdBuffer(lcdBuffer);
}

void pantalla_actualizar(bool showClock, uint8_t wantedMenu) {
    bool isNtpReady = rtc_on_sync();

    // 1) explicit clock request: always show if NTP is ready
    if ((wantedMenu == SELECCION_MENU_RELOJ) && isNtpReady) {
        pantalla_actualizarMenu(SELECCION_MENU_RELOJ);
        return;
    }

    // 2) periodic clock refresh if allowed and NTP is ready
    if (showClock && isNtpReady) {
        static unsigned long lastClockUpdate = 0;
        unsigned long now                    = millis();
        if ((now - lastClockUpdate) >= LCD_CLOCK_UPDATE_INTERVAL_MS) {
            lastClockUpdate = now;
            pantalla_actualizarMenu(SELECCION_MENU_RELOJ);
        }
        return;
    }

    // 3) normal menus (valid and not clock)
    if (wantedMenu < SELECCION_MENU_MAX && (wantedMenu != SELECCION_MENU_RELOJ)) {
        pantalla_actualizarMenu(wantedMenu);
    }
}

